sarjun/MSP430LocalNetwork/Source/CapstoneLocalComm/manchesterio-main.c
/*
 * main.c
 */
//#define DEBUG_XMITTER
//#define DEBUG_RCVR
//#define DEBUGGING
//Include Section:
#include <msp430.h>
#include "useful.h"
//This code is a skeleton for a Manchester Phase Encoded Transmitter
//It may transmit any number of bits up to 32.
//A separate start bit is sent, with a rising edge at mid-bit and a falling edge at the following mid-bit. The
// falling edge establishes the beginning of the transmission. This bit should be a full bit width in duration. Another way to think
// is that you are starting with a "10" sequence. Note that this (or a similar) scheme is necessary to "quiet" the AGC circuit
// in the receiver.
//After this, normal transmission is sent
//This version defines a 1 as a rising edge at mid-bit
//Transmission rate is 1 mS per bit.
//There is an inter-transmission time of 50 mS, then repeat transmission
//A 500uS clock tick is interrupt is required.

//Constant define section:
#define BITS_IN_TRANSMISSION  32
#define TRANSMIT_PIN          B8_3(P2OUT)
#define TRANSMIT_PORT         P2
#define TRANSMIT_PORT_DIR     P2DIR
#define TRANSMIT_BIT          3

#define TX_RCV_MODE			  B8_4(P1OUT)
#define TX_RCV_PORT_DIR       P1DIR
#define TX_RCV_BIT            4

//Establish bits and registers for receiver pins
#define RCV_CAPTURE_BIT0      2
#define RCV_CAPTURE_BIT1      4
#define RCV_PORT_SEL          P2SEL
#define RCV_PORT_SEL2         P2SEL2

#define DEBUG_LED             B8_0(P1OUT)
#define LED_PORT_DIR          P1DIR
#define LED_BIT               0
#define LED_ON                HIGH
#define LED_OFF               LOW

#define BOARD_LED1            B8_5(P1OUT)
#define LED1_PORT_DIR         P1DIR
#define LED1_BIT              5
#define BOARD_LED2            B8_5(P1OUT)
#define LED2_PORT_DIR         P2DIR
#define LED2_BIT              5
// Note that the tx_rcv mode should be high to receive.

//Defines for radio receiver
#define INTERWORD_DELAY       200    //This is in units of mS
#define SIZE_OF_RCV_QUE        4    //Must be a power of 2!

//The following defines are for bit width definitions
//The underlying assumptions are"
//The capture timers are updated with a 1uS resolution
//A full bit time is 1 mS nominal
#define VALID_HALF_BIT_MIN    450
#define VALID_HALF_BIT_MAX    550
#define VALID_FULL_BIT_MIN    950
#define VALID_FULL_BIT_MAX   1050
#define MISSING_EDGE_TIMEOUT 1200

//typedef section
enum Transmit_States {StartBit,NormalXmit,InterWord} ;
enum XmitClockPhase  {High,Low} ;
typedef struct {
	unsigned long        Transmit_Data         ;  //This is the data to actually be transmitted
	unsigned long        Transmit_Data_Buffer  ;  //This should be reloaded any time we wish to change what is transmitted.
	unsigned int         Bits_Remaining        ;  //This is the number of bits remaining in the current transmission
	enum XmitClockPhase  Transmit_Clock_Phase  ;  //This gets updated once every 1/2 bit period (500 uS in this case.)
	unsigned int         InterwordTimeout      ;  //This represents a "dead" period between successive transmissions
	enum Transmit_States Transmitter_State     ;  //This is the current state machine state for the transmitter
} TransmitterData ;

//Receiver Definitions and declarations
enum Captured_Edge {Rising,Falling} ;  //these are the 2 types of edges in the received signal
typedef enum Captured_Edge EdgeType ;
typedef struct {
	EdgeType     Edge      ;    // Which type of edge was received
	unsigned int TimeStamp ;    // When we got it.
} Event_Que_Entry ;

typedef struct {
	Event_Que_Entry Events[SIZE_OF_RCV_QUE] ; //What each entry looks like
	unsigned int  QueSize ;                   //Current size of queue
	unsigned int  Get_Index ;                 //Where we get data from
	unsigned int  Put_index ;                 //Where we put new data
} Event_Queue ;

enum Que_Errors {No_Error,Que_Full,Que_Empty} ;
typedef enum Que_Errors QueReturnErrors       ;

//The following typedefs are for the receiver section
typedef enum Rcv_States {Initial_Expect_Rising,Initial_Expect_Falling,MidBit_Expect_Rising,MidBit_Expect_Falling} ReceiverStates ;
typedef struct {
	ReceiverStates  CurrentRcvState      ;   // State for state machine implementation
	unsigned int	RisingEdgeTimeStamp  ;   // Time stamp at leading edge of signal
	unsigned int    FallingEdgeTimeStamp ;   // TIme stamp for falling edge
	unsigned int    PulseWidth           ;   // Difference in time between edges
	unsigned int    MidBitTimeStamp      ;   // Time Stamp of last valid mid-bit transition
	unsigned int    LastEdgeTimeStamp    ;   // When the last edge occured, regardless of polarity
	unsigned long   CurrentRecvdData     ;   // Data that is being shifted in
	unsigned long   LastValidReceived    ;   // Last complete valid word.
	unsigned int    BitsLeftToGet        ;   // Number of bits to go in reception.
}ManchesterReceiver;

typedef enum PulseWidths {Invalid_Width,Valid_HalfBit,Valid_FullBit} PulseWidthStatus ;

// ********************************************************************************************
// Function prototype declarations Section
void InitHardware(void) ; //This initializes all hardware subsystems, timer, ports etc.
void InitVariables(void); //All Global Variables are set up by this
void Xmit(TransmitterData * TData) ; //This routine is called every 500 uS by an interrupt handler.
void rcv(void) ;
//Receiver Queue functions:
//This function places a new event in the event queue structure.
//The rising and falling edge detectors should call this handler with the appropriate info!
QueReturnErrors InsertEvent(EdgeType DetectedEdge, unsigned int CapturedTime);

//This is called from within the main loop to see if there are any events on the que, i.e. captured edges.
//Note that it disables interrupts to ensure that data is not overwritten by an interrupter
//If no event is pending, it returns a -1, otherwise it returns an index into the queue that corresponds to the oldest
//event.
int GetEvent(void);

//This functions tests a current pulse width and determines if it is a valid width
PulseWidthStatus TestWidth(unsigned int CurrentPulse);

