sarjun/MSP430LocalNetwork/Source/CapstoneLocalComm/manchesterio-main.c
// Flashes LEDs a fixed number of times.
void blinkLEDs(int count);

// ************************************************************************************************

// **************************************************************************************
//Global Variables Section
// ************************************************************************************
TransmitterData Xmit1 ;  //This declares an instance of the transmitter data structure.
ManchesterReceiver Rcv1 ;
//Receiver Global Variables
Event_Queue Receiver_Events ;
#ifdef DEBUGGING
int   InsertFlag ;
EdgeType DebugEdge ;
unsigned int DummyTimer ;
unsigned int DummyTAR   ;
#endif

void debugging(void) ; //Just some dummy code to exercise the xmitter.
int idSeen = 0;	// The last ID seen, received from other boards.
int idSet = 0;	// Flag showing whether the ID has been set for this board or not.
int myID = 0;	// ID of this board.
int dest = 0;	// ID of the board to send a message to.
long payload = 0;	// Message body to send.
int doneIDPhase = 0;	// Flag showing that we are done with the ID phase.
int breakIDPhase = 0;	// Flag signaling that we should break out of the ID setting phase.
int setBufferFlag = 0;	// Flag showing whether we should set the data buffer based on the payload and dest,
						// should only be done once before sending, even though sending is a multi-step process.
int LEDFlashCounter = 0;	// Number of times the LED should flash, used when receiving messages.

void main(void) {
//Be sure to stop watchdog timer first!

	WDTCTL = WDTHOLD + WDTPW ;

	InitHardware() ;
	InitVariables() ;

//Enable Global Interrupts after all intializing is done.
#ifndef DEBUGGING
	_EINT() ;
#endif

	int canRead = 0;
	while(!breakIDPhase) {
		rcv() ; //Call the receiver
		if(Rcv1.BitsLeftToGet) {
			canRead = 1;
		}
		if(canRead) {
			if(!Rcv1.BitsLeftToGet && Rcv1.LastValidReceived) {
				canRead = 0;
				if(Rcv1.LastValidReceived == idSeen + 1) {
					idSeen++;
				}
				else { // ID setting stage is over; Someone that already had an id hit the button
					break;
				}
			}
		}
	}

	canRead = 0;
	doneIDPhase = 1;
	while (1) { //Main code loop here :

#ifdef DEBUG_RCVR
		if (InsertFlag != 0){
			_nop() ;
			InsertEvent(DebugEdge,DummyTimer) ;
			_nop() ;
			InsertEvent(DebugEdge,DummyTimer) ;
			_nop() ;
		}
#endif
		rcv() ;	//Call the receiver
		if(Rcv1.BitsLeftToGet) {
			canRead = 1;
		}
		if(canRead) {
			if(!Rcv1.BitsLeftToGet && Rcv1.LastValidReceived) {
				canRead = 0;
				_nop();	// Gets the wrong ID in here a lot because of button bouncing issues.
				if(myID == ((Rcv1.LastValidReceived >> 8) & 0xFF)) {
					LEDFlashCounter = Rcv1.LastValidReceived >> 16;
					blinkLEDs(LEDFlashCounter);
					_nop();	// Rarely gets to here when it should.
				}
			}
		}
#ifdef DEBUG_XMITTER
		debugging() ;
#endif
		_nop() ;
	}
}

//This function re-initializes the transmitter section
void ReinitXmitter(void) ;
//Set up globals, including the transmitter structure.
//Comment Well
void InitVariables(void){
//Here is an example:
//	Xmit1.Bits_Remaining = BITS_IN_TRANSMISSION ;
	Xmit1.Transmit_Data_Buffer = 0 ;
//	Xmit1.Transmit_Clock_Phase = Low ;
//"Real Initialization starts here
	ReinitXmitter() ;
//etc. .....
	Receiver_Events.Get_Index = 0 ;
	Receiver_Events.Put_index = 0 ;
	Receiver_Events.QueSize   = 0 ;

//etc.........
	Rcv1.CurrentRcvState = Initial_Expect_Rising ;
	Rcv1.CurrentRecvdData =      0 ;
	Rcv1.FallingEdgeTimeStamp =  0 ;
	Rcv1.RisingEdgeTimeStamp =   0 ;
	Rcv1.MidBitTimeStamp =       0 ;
	Rcv1.PulseWidth =            0 ;
	Rcv1.CurrentRecvdData =      0 ;
	Rcv1.LastValidReceived =     0 ;

}

int send = 0;
//This routine manages the actual transmitter and is called every 500uS by a periodic interrupt.
//Comment Well
void Xmit(TransmitterData* TData) {
	enum XmitClockPhase Phase;
	unsigned long  Test_MSBit ; //This is used as a boolean to test the XOR of the MS Bit of the Xmitted Word.
	Phase = TData->Transmit_Clock_Phase ;
	Test_MSBit = TData->Transmit_Data & 0x80000000 ; // We will use this as an "XOR" test in the transmitter phases.
//Now do state machine
	switch(TData->Transmitter_State){
		case StartBit : //This sends the equivalent of a 1-0 preamble to start the receiver in the right state.
			TX_RCV_MODE = HIGH ;
			DEBUG_LED = LED_ON ;
			switch(Phase) {
				case Low :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = HIGH ;
					}
					else {
						TRANSMIT_PIN = LOW ;
					}
					TData->Transmit_Data <<= 1 ;
					if (--TData->Bits_Remaining == 0) { //Here we have used up all bits on to next phase
						TData->Bits_Remaining = BITS_IN_TRANSMISSION ;
						TData->Transmit_Data  = TData->Transmit_Data_Buffer ;  //Transfer the buffer to the real word to be shifted out
						TData->Transmitter_State = NormalXmit ;
					}
				break ;
				case High :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = LOW ;
					}
					else {
						TRANSMIT_PIN = HIGH ;
					}
				break ;
			}
		break ;

		case NormalXmit :
			switch(Phase) {
				case Low :
					if (Test_MSBit != 0) {
						TRANSMIT_PIN = HIGH ;
					}
					else {
						TRANSMIT_PIN = LOW ;
					}
					TData->Transmit_Data <<= 1 ;        //get the next bit up to go
					if (--TData->Bits_Remaining == 0) { //Here we have used up all bits on to next phase
						TData->InterwordTimeout = INTERWORD_DELAY ; //This delays 50 mS between Xmissions
						TData->Transmitter_State = InterWord ;
					}
				break ;
				case High :
					if (Test_MSBit != 0) {  //Effectively an XOR operation
						TRANSMIT_PIN = LOW ;
					}
					else {
						TRANSMIT_PIN = HIGH ;
					}
				break ;
			}

		break ;
		case InterWord :
			TX_RCV_MODE = LOW ;
			DEBUG_LED = LED_OFF ;
			switch(Phase) {
				case Low :
					TRANSMIT_PIN = LOW ;
					if (--TData->InterwordTimeout == 0){
						ReinitXmitter() ;
						send = 0;
						if(idSet) {
							breakIDPhase = 1;
						}
						idSet = 1;
					}

				break ;
				case High :
					TRANSMIT_PIN = LOW ;
				break ;
			}

		break ;
		default :
			ReinitXmitter() ;
//Other intitialization here.....
		break ;

