sarjun/MSP430LocalNetwork/Source/CapstoneLocalComm/manchesterio-main.c
    /*
     * Basic Clock System Control 3
     *
     * XT2S_0 -- 0.4 - 1 MHz
     * LFXT1S_2 -- If XTS = 0, XT1 = VLOCLK ; If XTS = 1, XT1 = 3 - 16-MHz crystal or resonator
     * XCAP_1 -- ~6 pF
     */
    BCSCTL3 = XT2S_0 + LFXT1S_2 + XCAP_1;
}

// *****************************************************************************************

/*
 *  ======== Timer0_A3_init ========
 *  Initialize MSP430 Timer0_A3 timer
 */
void Timer0_A3_initial(void)
{
	 /*
	     * TA0CCTL0, Capture/Compare Control Register 0
	     *
	     * CM_0 -- No Capture
	     * CCIS_0 -- CCIxA
	     * ~SCS -- Asynchronous Capture
	     * ~SCCI -- Latched capture signal (read)
	     * ~CAP -- Compare mode
	     * OUTMOD_0 -- PWM output mode: 0 - OUT bit value
	     *
	     * Note: ~<BIT> indicates that <BIT> has value zero
	     */
	    TA0CCTL0 = CM_0 + CCIS_0 + OUTMOD_0 + CCIE;

	    /* TA0CCR0, Timer_A Capture/Compare Register 0 */
	    TA0CCR0 = 499;

	    /*
	     * TA0CTL, Timer_A3 Control Register
	     *
	     * TASSEL_2 -- SMCLK
	     * ID_3 -- Divider - /8
	     * MC_1 -- Up Mode
	     */
	    TA0CTL = TASSEL_2 + ID_3 + MC_1;
}

/*
 *  ======== Timer1_A3_init ========
 *  Initialize MSP430 Timer1_A3 timer
 */
void Timer1_A3_initial(void)
{
	/*
	     * TA1CCTL2, Capture/Compare Control Register 2
	     *
	     * CM_1 -- Rising Edge
	     * CCIS_0 -- CCIxA
	     * SCS -- Sychronous Capture
	     * ~SCCI -- Latched capture signal (read)
	     * CAP -- Capture mode
	     * OUTMOD_0 -- PWM output mode: 0 - OUT bit value
	     *
	     * Note: ~SCCI indicates that SCCI has value zero
	     */
	    TA1CCTL2 = CM_1 + CCIS_0 + SCS + CAP + OUTMOD_0 + CCIE;

	    /*
	     * TA1CCTL1, Capture/Compare Control Register 1
	     *
	     * CM_2 -- Falling Edge
	     * CCIS_0 -- CCIxA
	     * SCS -- Sychronous Capture
	     * ~SCCI -- Latched capture signal (read)
	     * CAP -- Capture mode
	     * OUTMOD_0 -- PWM output mode: 0 - OUT bit value
	     *
	     * Note: ~SCCI indicates that SCCI has value zero
	     */
	    TA1CCTL1 = CM_2 + CCIS_1 + SCS + CAP + OUTMOD_0 + CCIE;

	    /*
	     * TA1CCTL2, Capture/Compare Control Register 2
	     *
	     * CM_2 -- Falling Edge
	     * CCIS_0 -- CCIxA
	     * SCS -- Sychronous Capture
	     * ~SCCI -- Latched capture signal (read)
	     * CAP -- Capture mode
	     * OUTMOD_0 -- PWM output mode: 0 - OUT bit value
	     *
	     * Note: ~SCCI indicates that SCCI has value zero
	     */
//	    TA1CCTL2 = CM_2 + CCIS_0 + SCS + CAP + OUTMOD_0;

	    /*
	     * TA1CTL, Timer_A3 Control Register
	     *
	     * TASSEL_2 -- SMCLK
	     * ID_3 -- Divider - /8
	     * MC_2 -- Continuous Mode
	     */
	    TA1CTL = TASSEL_2 + ID_3 + MC_2;
}

void debugging(void){
	Xmit(&(Xmit1)) ;
}

